#ifndef __RS485_H
#define __RS485_H			 
#include "stm32f10x.h"


extern u8 RS485_RX_BUF[1];  	//接收缓冲
extern u8 RS485_RX_CNT;

//模式控制
#define RS485_TX_EN(X)		 (((X)==1)?(GPIOE->BSRR |= 1<<4):(GPIOE->BRR |= 1<<4))  	//485模式控制.0,接收;1,发送.


/********************************************************************
*	功能：485初始化
*	参数：bound 波特率
********************************************************************/  
void RS485_Init(u32 BaudRate);

/**********************************************************
*	功能：发送数据
*	参数：buf 发送缓冲区首地址
*		  len 待发送的字节数
**********************************************************/
void RS485_Send_Data(uint8_t *buf,u16 len);
void GPIO_Tx_Config(u8 Set);





#endif	   
















